app/controllers/api/v1/challenges_controller.rb

      def index
        @challenge = Challenge.all
---
SELECT "challenges".* FROM "challenges"

      def create
        challenge = Challenge.new(challenge_params)
        if challenge.save
---
INSERT INTO "challenges" ("title", "description", "start_date", "end_date", "created_at", "updated_at") VALUES ('Challenge2', 'YOur challenge is to be inside fire for 10 minutes', '2025-04-20', '2025-05-06', '2025-04-20 06:55:35.978794', '2025-04-20 06:55:35.978794') RETURNING "id"

      def show
        challenge = Challenge.find(params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 2 LIMIT 1

      def update
        challenge = Challenge.find(params[:id])
        if challenge.update(challenge_params)
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 2 LIMIT 1
UPDATE "challenges" SET "title" = 'Challenge3', "description" = 'YOur challenge is to be inside fire for 10 minutes', "end_date" = '2025-05-06', "updated_at" = '2025-04-20 07:05:21.112293' WHERE "challenges"."id" = 2

      def destroy
        challenge = Challenge.find(params[:id])
        if challenge.destroy
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 2 LIMIT 1
DELETE FROM "challenges" WHERE "challenges"."id" = 2